Repository: franknguyenit/web-imm-translation
Catalog: bo-nho-dich/bo-nho-dich.tmx
Source language: vi
Languages: en

source: David Crawford
en: Portrait of David Crawford, Managing Partner

source: [David Crawford](https://immgroup.com/doi-ngu-imm-group/david-crawford/)
en: [David Crawford](https://immgroup.com/en/our-people/david-crawford/)

source: Luật sư Điều hành
en: Managing Partner

source: Darren Silver
en: Portrait of Darren Silver, Founding Partner

source: [Darren Silver](https://immgroup.com/doi-ngu-imm-group/darren-silver/)
en: [Darren Silver](https://immgroup.com/en/our-people/darren-silver/)

source: Mark I. Davies
en: Portrait of Mark I. Davies, Global Managing Partner and Founder Chair

source: [Mark I. Davies](https://immgroup.com/doi-ngu-imm-group/mark-i-davies/)
en: [Mark I. Davies](https://immgroup.com/en/our-people/mark-i-davies/)

source: Chủ tịch kiêm Luật sư Điều hành toàn cầu
en: Global Managing Partner and Founder Chair

source: Nicole Jadelrab
en: Portrait of Nicole Jadelrab, Principal/Founder

source: [Nicole Jadelrab](https://immgroup.com/doi-ngu-imm-group/nicole-jadelrab/)
en: [Nicole Jadelrab](https://immgroup.com/en/our-people/nicole-jadelrab/)

source: Stephen Lockyer
en: Portrait of Stephen Lockyer, Founder

source: [Stephen Lockyer](https://immgroup.com/doi-ngu-imm-group/stephen-lockyer/)
en: [Stephen Lockyer](https://immgroup.com/en/our-people/stephen-lockyer/)

source: Cosmina Morariu
en: Portrait of Cosmina Morariu, Senior Manager at Fragomen (Toronto)

source: [Cosmina Morariu](https://immgroup.com/doi-ngu-imm-group/cosmina-morariu/)
en: [Cosmina Morariu](https://immgroup.com/en/our-people/cosmina-morariu/)

source: Luật sư cấp cao Văn phòng Luật Fragomen (Toronto)
en: Senior Manager, Fragomen (Toronto)

source: Teresa Liu
en: Portrait of Teresa Liu, Managing Partner, Fragomen Australia & New Zealand

source: [Teresa Liu](https://immgroup.com/doi-ngu-imm-group/teresa-liu/)
en: [Teresa Liu](https://immgroup.com/en/our-people/teresa-liu/)

source: Luật sư Điều hành Fragomen Úc & New Zealand
en: Managing Partner, Fragomen Australia & New Zealand

source: André Miranda
en: Portrait of André Miranda, Founding Partner

source: [André Miranda](https://immgroup.com/doi-ngu-imm-group/andre-miranda/)
en: [André Miranda](https://immgroup.com/en/our-people/andre-miranda/)

source: Demetris Demetriades
en: Portrait of Demetris Demetriades, Managing Partner and Head of the Immigration and Real Estate Department

source: [Demetris Demetriades](https://immgroup.com/doi-ngu-imm-group/demetris-demetriades/)
en: [Demetris Demetriades](https://immgroup.com/en/our-people/demetris-demetriades/)

source: Luật sư điều hành kiêm Trưởng bộ phận Di trú và Bất động sản
en: Managing Partner and Head of the Immigration and Real Estate Department

source: Vicky Veli
en: Portrait of Vicky Veli, Attorney-at-Law

source: [Vicky Veli](https://immgroup.com/doi-ngu-imm-group/vicky-veli/)
en: [Vicky Veli](https://immgroup.com/en/our-people/vicky-veli/)

source: Afi Ventour de Vega
en: Portrait of Afi Ventour de Vega, CEO

source: [Afi Ventour de Vega](https://immgroup.com/doi-ngu-imm-group/afi-ventour-de-vega/)
en: [Afi Ventour de Vega](https://immgroup.com/en/our-people/afi-ventour-de-vega/)

source: Dahlia Joseph Rowe
en: Portrait of Dahlia Joseph Rowe, Founding Attorney

source: [Dahlia Joseph Rowe](https://immgroup.com/doi-ngu-imm-group/dahlia-joseph-rowe/)
en: [Dahlia Joseph Rowe](https://immgroup.com/en/our-people/dahlia-joseph-rowe/)

source: Luật sư Sáng lập
en: Founding Attorney

source: Owen Small
en: Portrait of Owen Small, Managing Director

source: [Owen Small](https://immgroup.com/doi-ngu-imm-group/owen-small/)
en: [Owen Small](https://immgroup.com/en/our-people/owen-small/)

source: Gerhard Combrinck
en: Portrait of Gerhard Combrinck, Director

source: [Gerhard Combrinck](https://immgroup.com/doi-ngu-imm-group/gerhard-combrinck/)
en: [Gerhard Combrinck](https://immgroup.com/en/our-people/gerhard-combrinck/)

source: Giám đốc Điều hành
en: CEO

source: Livia Yuan
en: Portrait of Livia Yuan, Case Processing Director

source: [Livia Yuan](https://immgroup.com/doi-ngu-imm-group/livia-yuan/)
en: [Livia Yuan](https://immgroup.com/en/our-people/livia-yuan/)

source: Giám đốc thụ lý hồ sơ
en: Case Processing Director

source: Sam Wolfe
en: Portrait of Sam Wolfe, Chief Operating Officer – Asia

source: [Sam Wolfe](https://immgroup.com/doi-ngu-imm-group/sam-wolfe/)
en: [Sam Wolfe](https://immgroup.com/en/our-people/sam-wolfe/)

source: Giám đốc Điều hành | Thị trường châu Á
en: Chief Operating Officer – Asia

source: Hoàng Đinh Ngọc Trang
en: Portrait of Hoang Dinh Ngoc Trang (Sam), Product Development Specialist at IMM Group

source: [Hoàng Đinh Ngọc Trang](https://immgroup.com/doi-ngu-imm-group/hoang-dinh-ngoc-trang/)
en: [Hoang Dinh Ngoc Trang](https://immgroup.com/en/our-people/hoang-dinh-ngoc-trang/)

source: Chuyên viên Phát triển Sản phẩm
en: Product Development Specialist

source: Hà Huỳnh Phương Trinh
en: Portrait of Ha Huynh Phuong Trinh (Tracy), Business Development & Partnerships Manager at IMM Group

source: [Hà Huỳnh Phương Trinh](https://immgroup.com/doi-ngu-imm-group/ha-huynh-phuong-trinh/)
en: [Ha Huynh Phuong Trinh](https://immgroup.com/en/our-people/ha-huynh-phuong-trinh/)

source: Quản lý Phát triển Kinh doanh & Đối tác
en: Business Development & Partnerships Manager

source: Xem hồ sơ
en: View profile

source: CÂU CHUYỆN HỒ SƠ
en: Client case stories

source: Thêm 1 gia đình Việt Nam được cấp Passport lên quốc tịch Grenada, gọn gàng với sự chuẩn bị kỹ lưỡng của chuyên viên thụ lý IMM Group
en: Another family granted Grenada citizenship and passports, with thorough preparation by IMM Group's case team

source: Thời gian xét duyệt thực tế để nhận passport Grenada được thụ lý bởi IMM Group này là 14 tháng để có…
en: The actual processing time for this Grenada passport application, handled by IMM Group, was 14 months to…

source: Bí quyết để bộ hồ sơ quốc tịch nhanh được chấp thuận trong vỏn vẹn dưới 60 ngày, hoàn tất mọi thủ tục trong 6 tháng
en: How a citizenship application was approved in under 60 days, with every procedure completed in 6 months

source: Tham gia chia sẻ có ông Trần Tuấn Anh (bên trái) - Phó Giám đốc Điều hành IMM Group, kiêm Giám đốc…
en: Taking part in the discussion: Mr. Tran Tuan Anh (left), Deputy Chief Operating Officer of IMM Group, who also serves as Director…

source: “Bằng mọi giá, IMM Group phải giúp cho cháu nó đoàn viên với gia đình anh chị bên Úc!”
en: "Whatever it takes, IMM Group must help reunite the child with the family in Australia!"

source: Tham gia chia sẻ có anh Nguyễn Xuân Sinh (bên trái) – Giám đốc Điều hành IMM Group, hiện phụ trách Khu…
en: Taking part in the discussion: Mr. Nguyen Xuan Sinh (left), Chief Operating Officer of IMM Group, currently in charge of the…

source: Đọc thêm
en: Read more

source: ĐÁNH GIÁ TỪ KHÁCH HÀNG
en: Client reviews

source: Anh Ngô Triết Quang
en: Mr. Ngo Triet Quang

source: 09/04/2026, 10:05 am
en: April 9, 2026, 10:05 am

source: Nhiệt huyết trong công việc, xinh đẹp dể thương, xem khách hàng như anh chị trong gia đình. Cảm ơn IMM
en: Passionate about her work, pretty and friendly, and treats clients like family. Thank you, IMM

source: Chương trình tư vấn: Di trú Grenada
en: Program: Grenada immigration

source: Anh Hồ Thanh Huy
en: Mr. Ho Thanh Huy

source: 03/04/2026, 10:03 am
en: April 3, 2026, 10:03 am

source: Ngọc làm dịch vụ rất tốt.
en: Ngoc provided very good service.

source: Chuyên viên hồ sơ: Lê Thị Hồng Ngọc (Dolly),
en: Case officer: Le Thi Hong Ngoc (Dolly),

source: Chị Đoàn Phương Minh Lan
en: Ms. Doan Phuong Minh Lan

source: 18/03/2026, 9:58 am
en: March 18, 2026, 9:58 am

source: Chương trình tư vấn: Di trú Úc - 188
en: Program: Australia immigration – 188

source: Anh Trần Quang Thuấn
en: Mr. Tran Quang Thuan

source: 23/02/2026, 9:56 am
en: February 23, 2026, 9:56 am

source: Hài lòng 200%
en: 200% satisfied

source: Anh Nguyễn Việt Phương
en: Mr. Nguyen Viet Phuong

source: 23/02/2026, 9:52 am
en: February 23, 2026, 9:52 am

source: Bạn Trang luôn luôn hết lòng vì quyền lợi của khách hàng
en: Trang is always wholeheartedly committed to her clients' interests

source: Chương trình tư vấn: Di trú Malta (MPRP)
en: Program: Malta immigration (MPRP)

source: Anh Phùng Vũ Cường
en: Mr. Phung Vu Cuong

source: 20/01/2026, 9:48 am
en: January 20, 2026, 9:48 am

source: Cảm ơn Huy, rất chuyên nghiệp khi thụ lý hồ sơ
en: Thank you, Huy, for handling my application so professionally

source: Chị Đoàn Thanh Thiên Vân
en: Ms. Doan Thanh Thien Van

source: 25/12/2025, 9:39 am
en: December 25, 2025, 9:39 am

source: Luật sư và Trang rất nhiệt tình, đã nộp hồ sơ của tôi sớm nhất có thể dù là chủ nhật hay ngày lễ.
en: The lawyer and Trang were very dedicated and filed my application as early as possible, even on Sundays and public holidays.

source: Anh/Chị Lê Vũ Đam | Trần Thị Thảo Hiền
en: Mr. Le Vu Dam & Ms. Tran Thi Thao Hien

source: 02/12/2025, 9:36 am
en: December 2, 2025, 9:36 am

source: Hơn 3 năm qua cũng là một khoảng thời gian dài tôi và Trang làm việc cùng nhau. Cô ấy rất chi tiết - tận tình - chuyên nghiệp hướng dẫn tôi hiểu dễ dàng để thực hiện mọi vấn đề liên qua trong việc chuẩn bị hồ sơ! Tôi gởi lời cảm ơn đến Minh Trang!!!
en: Trang and I have worked together for more than 3 years. She is very thorough, caring, and professional, and guided me so I could easily understand and handle everything involved in preparing my application! My thanks to Minh Trang!!!

source: Chương trình tư vấn: Di trú Thổ Nhĩ Kỳ
en: Program: Turkey immigration

source: Chuyên viên hồ sơ: Nguyễn Tấn Huy (Charles),
en: Case officer: Nguyen Tan Huy (Charles),

source: Anh Vũ Quan Luật
en: Mr. Vu Quan Luat

source: 05/11/2025, 9:34 am
en: November 5, 2025, 9:34 am

source: Huy còn trẻ nhưng quản lý công việc cẩn thẩn, chi tiết, hỗ trợ nhiệt tình. Tôi đánh giá 5 sao.
en: Huy is young, but he manages everything carefully and thoroughly and is very supportive. I give him 5 stars.

source: Cực kỳ hài lòng!
en: Extremely satisfied!

source: Chương trình tư vấn: Di trú Úc - 888
en: Program: Australia immigration – 888

source: Chuyên viên hồ sơ: Nguyễn Thị Minh Trang (Olive),
en: Case officer: Nguyen Thi Minh Trang (Olive),

source: VP: IMM Group Hồ Chí Minh
en: Office: IMM Group Ho Chi Minh City

source: Chị Mai Thị Thảo Yến
en: Ms. Mai Thi Thao Yen

source: 04/11/2025, 9:30 am
en: November 4, 2025, 9:30 am

source: Thay mặt gia đình, Anh chị cám ơn Trang và IMM thật nhiều. Gia đoạn 5 năm đồng hành của IMM với gia đình chị từ lúc xin visa 188A rồi đến 888 thật nhiều vất vả nhưng bằng sự cố gắng, tận tâm và chuyên nghiệp của em cùng team IMM đã vượt qua tất cả. Trân trọng và biết ơn các em thật nhiều . Chắc chắn anh chị sẽ giới thiệu dịch vụ của IMM đến bạn bè
en: On behalf of our family, we thank Trang and IMM very much. Over the 5 years IMM has accompanied our family, from the 188A visa application through to the 888, there was a lot of hard work, but with your effort, dedication and professionalism, you and the IMM team overcame it all. We truly appreciate you and are very grateful. We will certainly recommend IMM's services to our friends

source: Xem thêm đánh giá
en: See more reviews

source: Công ty thành viên IMM Group
en: IMM Group member companies

source: IMM Group xây dựng hệ sinh thái các đơn vị thành viên hoạt động đồng bộ, kết nối nguồn lực và chuyên môn nhằm mang đến giải pháp toàn diện và giá trị bền vững cho khách hàng.
en: IMM Group has built an ecosystem of member companies that work in concert, combining resources and expertise to deliver comprehensive solutions and lasting value to clients.

source: Visa Định Cư Mỹ EB-5
en: Cover image for IMM Group's EB-5 visa video

source: Hạn cuối nộp hồ sơ I-526E: 30/09/2026
en: Grandfathering cutoff for Form I-526E filings: September 30, 2026

source: Dự án EB-5 | Khu dân cư phức hợp thương mại Haven Residences
en: Haven Residences, a mixed-use residential and commercial EB-5 project

source: Chấp thuận I-956F
en: Form I-956F approved

source: [Dự án EB-5 | Khu dân cư phức hợp thương mại Haven Residences](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb5/du-an-eb-5-khu-dan-cu-phuc-hop-thuong-mai-haven-residences/)
en: [EB-5 project: Haven Residences mixed-use development](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb5/du-an-eb-5-khu-dan-cu-phuc-hop-thuong-mai-haven-residences/)

source: Dự án EB-5 | Ecoplastic – Nhà máy sản xuất phụ tùng ô tô Hyundai
en: Ecoplastic, an EB-5 project to build a Hyundai auto parts manufacturing plant

source: Độc quyền của IMM Group
en: Exclusive to IMM Group

source: [Dự án EB-5 | Ecoplastic – Nhà máy sản xuất phụ tùng ô tô Hyundai](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb5/du-an-eb-5-ecoplastic-nha-may-san-xuat-phu-tung-o-to-hyundai/)
en: [EB-5 project: Ecoplastic – Hyundai auto parts manufacturing plant](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb5/du-an-eb-5-ecoplastic-nha-may-san-xuat-phu-tung-o-to-hyundai/)

source: Dự án EB-5 | Khu nghỉ dưỡng và chăm sóc sức khỏe người cao tuổi Horseshoe Bay
en: Horseshoe Bay, an EB-5 resort and senior wellness community project

source: Ưu tiên xét duyệt nhanh
en: Eligible for priority processing

source: [Dự án EB-5 | Khu nghỉ dưỡng và chăm sóc sức khỏe người cao tuổi Horseshoe Bay](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb5/khu-nghi-duong-va-cham-soc-suc-khoe-nguoi-cao-tuoi-horseshoe-bay/)
en: [EB-5 project: Horseshoe Bay resort and senior wellness community](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb5/khu-nghi-duong-va-cham-soc-suc-khoe-nguoi-cao-tuoi-horseshoe-bay/)

source: Mức đầu tư: 800.000 USD
en: Investment: US$800,000

source: [So sánh các chương trình đầu tư định cư Mỹ](https://immgroup.com/dau-tu-dinh-cu-my/)
en: [Compare U.S. investment immigration programs](https://immgroup.com/dau-tu-dinh-cu-my/)

source: [Visa Mỹ E-2](https://immgroup.com/dau-tu-dinh-cu-my/visa-my-e2/)
en: [U.S. E-2 visa](https://immgroup.com/dau-tu-dinh-cu-my/visa-my-e2/)

source: [Visa Mỹ L-1A](https://immgroup.com/dau-tu-dinh-cu-my/visa-my-l1a/)
en: [U.S. L-1A visa](https://immgroup.com/dau-tu-dinh-cu-my/visa-my-l1a/)

source: [Visa định cư Mỹ EB-1C](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb1c/)
en: [U.S. EB-1C immigrant visa](https://immgroup.com/dau-tu-dinh-cu-my/visa-dinh-cu-my-eb1c/)

source: [Cuộc sống tại Mỹ](https://immgroup.com/hieu-ve-nuoc-my/#n0)
en: [Living in the U.S.](https://immgroup.com/hieu-ve-nuoc-my/#n0)

source: [Thuế Mỹ](https://immgroup.com/hieu-ve-nuoc-my/#n1)
en: [U.S. taxes](https://immgroup.com/hieu-ve-nuoc-my/#n1)

source: [Kinh doanh tại Mỹ](https://immgroup.com/hieu-ve-nuoc-my/#n2)
en: [Doing business in the U.S.](https://immgroup.com/hieu-ve-nuoc-my/#n2)

source: [Giáo dục tại Mỹ](https://immgroup.com/hieu-ve-nuoc-my/#n3)
en: [Education in the U.S.](https://immgroup.com/hieu-ve-nuoc-my/#n3)

source: [Trợ cấp, phúc lợi, an sinh xã hội Mỹ](https://immgroup.com/hieu-ve-nuoc-my/#n4)
en: [U.S. benefits, welfare, and Social Security](https://immgroup.com/hieu-ve-nuoc-my/#n4)

source: [Những người Việt thành công trên đất Mỹ](https://immgroup.com/hieu-ve-nuoc-my/#n5)
en: [Success stories in America](https://immgroup.com/hieu-ve-nuoc-my/#n5)

source: [Những câu chuyện định cư Mỹ truyền cảm hứng](https://immgroup.com/hieu-ve-nuoc-my/#n6)
en: [Inspiring stories of immigrating to the U.S.](https://immgroup.com/hieu-ve-nuoc-my/#n6)

source: Đăng ký tư vấn đầu tư định cư
en: Request a consultation

source: IMM Group đồng hành cùng Anh/Chị đánh giá khả năng thành công của hồ sơ trước khi quyết định đầu tư. Xin Anh/Chị dành một phút để cung cấp thông tin.
en: IMM Group can help you assess your case's prospects before you commit to an investment. Please take a minute to share a few details.

source: 7 câu hỏi ngắn.
en: 7 short questions.

source: Bắt đầu
en: Get started

source: IMM Group · Tư vấn đầu tư định cư quốc tế từ 2005 — IMM Group chỉ tư vấn chương trình doanh nhân – đầu tư, không nhận hồ sơ diện xuất khẩu lao động hoặc lao động phổ thông (EB-3 và tương tự).
en: IMM Group · International investment migration advisory since 2005 — IMM Group advises only on entrepreneur and investor programs and does not accept overseas labor placement or unskilled worker cases (EB-3 and similar).

source: Visa Định Cư Mỹ {1}EB-5{/1}
en: {1}EB-5{/1} Visa: A Path to a U.S. Green Card for Your Whole Family

source: Chương trình đầu tư định cư Mỹ, được Quốc hội Mỹ thông qua năm 1990
en: The EB-5 visa is a U.S. investment immigration program established by Congress in 1990

source: Mức đầu tư tối thiểu **800.000 USD** - khoảng 21 tỷ đồng
en: Minimum investment: **US$800,000** in a Targeted Employment Area (TEA) project

source: Tạo 10 việc làm toàn thời gian cho người Mỹ
en: Creation of 10 full-time jobs for U.S. workers

source: Cả gia đình nhận thẻ xanh: vợ/chồng và con dưới 21 tuổi
en: Green cards for the whole family: you, your spouse, and your unmarried children under 21

source: Đầu tư EB-5 qua Trung tâm vùng - lộ trình gọn, an toàn, minh bạch
en: EB-5 investment through a regional center: a streamlined, transparent process with structured risk management

source: Hạn cuối nộp hồ sơ {1}I-526E{/1}:{br} {2}30 / 09 / 2026{/2}
en: Grandfathering deadline for Form {1}I-526E{/1} filings:{br} {2}September 30, 2026{/2}

source: Cơ chế Grandfathering — Bảo lưu hồ sơ
en: Grandfathering protection for filed petitions

source: Bảo vệ hồ sơ
en: Petition protection

source: QUYỀN LỢI CỦA VISA ĐỊNH CƯ MỸ EB-5
en: Benefits of the EB-5 visa

source: Vợ/chồng và con dưới 21 tuổi
en: Your spouse and unmarried children under 21

source: Quyền lợi như công dân Mỹ
en: Many of the same rights as U.S. citizens

source: Tự do sinh sống, học tập và làm việc trên toàn nước Mỹ
en: Freedom to live, study, and work anywhere in the United States

source: Hộ chiếu Mỹ quyền lực
en: A path to a U.S. passport

source: Tự do đi lại toàn cầu - hộ chiếu Mỹ miễn visa hoặc visa điện tử tới hơn 180 quốc gia
en: Freedom to travel globally: once naturalized, you can apply for a U.S. passport, which offers visa-free or eVisa access to 180+ destinations

source: Ra vào Mỹ không giới hạn
en: Travel in and out of the U.S. as needed

source: Tự do đi lại mọi lúc
en: Travel when your plans require, while maintaining your permanent residence

source: Giáo dục ưu việt cho con
en: A strong education for your children

source: Miễn phí trường công, từ tiểu học đến THPT
en: Free public schooling from elementary through high school

source: Học phí đại học thấp hơn nhiều so với du học sinh
en: Public university tuition that can be far lower than what international students pay

source: Được học ngành chỉ dành cho thường trú nhân & công dân Mỹ
en: Access to programs open only to U.S. permanent residents and citizens

source: ƯU ĐIỂM CHƯƠNG TRÌNH ĐỊNH CƯ MỸ EB-5
en: Advantages of the EB-5 investor visa

source: Lấy thẻ xanh trực tiếp
en: A direct path to a green card

source: Không qua nhiều bước, không đi đường vòng
en: No intermediate visa stages, no detours

source: Quốc tịch Mỹ sau 5 năm
en: A path to U.S. citizenship after 5 years

source: Cả gia đình thành công dân Mỹ – đủ điều kiện xin quốc tịch sau 5 năm thường trú, con cái lớn lên là người Mỹ trọn quyền
en: Your family can become eligible for U.S. citizenship after 5 years as permanent residents, and your children can grow up as U.S. citizens with full rights

source: Không cần kinh nghiệm kinh doanh
en: No business experience required

source: Không ràng buộc kinh doanh
en: No business obligations

source: Không cần sở hữu hay quản lý công ty
en: No need to own or manage a company

source: Không bắt buộc mở công ty sau khi có thẻ xanh
en: No requirement to start a company after receiving your green card

source: Không cần công ty hay gia đình bảo lãnh
en: No employer or family sponsor required

source: Chỉ cần đầu tư vào dự án đạt điều kiện
en: Your role is to invest in a qualifying project

source: ĐIỀU KIỆN LẤY VISA ĐỊNH CƯ MỸ EB-5
en: EB-5 visa requirements

source: Từ 18 tuổi
en: Age 18 or older

source: Đầu tư 800.000 USD
en: Invest US$800,000

source: Vào dự án thuộc vùng khuyến khích đầu tư (TEA)
en: In a project located in a Targeted Employment Area (TEA)

source: Nguồn vốn hợp pháp
en: Lawful source of funds

source: Chứng minh nguồn gốc số tiền đầu tư
en: Document the lawful source of your investment funds

source: Tạo 10 việc làm
en: Create 10 jobs

source: Việc làm toàn thời gian cho người bản xứ
en: Full-time positions for qualifying U.S. workers

source: LỘ TRÌNH ĐỊNH CƯ EB-5
en: The EB-5 visa process

source: Chuẩn bị hồ sơ & chứng minh nguồn tiền
en: Prepare your petition and document your source of funds

source: Hoàn thiện hồ sơ pháp lý và làm rõ nguồn gốc vốn đầu tư.
en: Complete your legal documentation and establish the source of your investment capital.

source: Hoàn tất chuyển khoản theo hợp đồng EB-5.
en: Complete the transfer as set out in your EB-5 subscription agreement.

source: Nộp hồ sơ I-526E
en: File Form I-526E

source: Đệ trình đơn xin nhà đầu tư định cư lên Sở Di trú Hoa Kỳ.
en: Submit your investor petition to U.S. Citizenship and Immigration Services (USCIS).

source: Nhận kết quả I-526E
en: Receive your Form I-526E decision

source: USCIS phê duyệt hồ sơ đầu tư.
en: USCIS adjudicates your investor petition.

source: Nộp hồ sơ tại Trung tâm Thị thực Quốc gia (NVC)
en: File with the National Visa Center (NVC)

source: Hoàn tất thủ tục xét duyệt visa.
en: Complete visa processing.

source: Phỏng vấn
en: Attend your interview

source: Tham dự phỏng vấn tại Lãnh sự quán Hoa Kỳ.
en: Attend an interview at a U.S. embassy or consulate.

source: Nhận visa định cư EB-5
en: Receive your EB-5 immigrant visa

source: Được cấp thị thực định cư diện EB-5.
en: You are issued an EB-5 immigrant visa.

source: Nhập cảnh Hoa Kỳ & kích hoạt thẻ xanh
en: Enter the U.S. and receive your conditional green card

source: Sang Mỹ để kích hoạt thẻ xanh có điều kiện (2 năm).
en: Travel to the U.S. to begin your conditional permanent residence; your conditional green card is valid for 2 years.

source: Nộp hồ sơ I-829 xóa điều kiện
en: File Form I-829 to remove conditions

source: Đệ trình sau khi đủ 21 tháng kể từ ngày có thẻ xanh.
en: File once 21 months have passed since you received your green card.

source: Rút vốn đầu tư
en: Exit your investment

source: Thu hồi vốn theo thỏa thuận với dự án.
en: Seek a return of capital under the terms of your agreement with the project.

source: Nhận chấp thuận thường trú vĩnh viễn
en: Receive unconditional permanent residence

source: Được cấp thẻ thường trú nhân không điều kiện (10 năm).
en: You receive a 10-year green card as an unconditional permanent resident.

source: Nộp hồ sơ xin quốc tịch
en: Apply for U.S. citizenship

source: Đủ điều kiện sau 5 năm thường trú.
en: Eligible after 5 years of permanent residence.

source: CÁC DỰ ÁN EB-5
en: Current EB-5 projects

source: So sánh các chương trình đầu tư định cư Mỹ
en: Compare U.S. investment immigration programs

source: Visa Mỹ E-2
en: U.S. E-2 treaty investor visa

source: Visa Mỹ L-1A
en: U.S. L-1A intracompany transferee visa

source: Visa định cư Mỹ EB-1C
en: EB-1C green card for multinational executives and managers

source: Hiểu về nước Mỹ
en: Understanding America

source: Cuộc sống tại Mỹ
en: Living in the U.S.

source: Thuế Mỹ
en: Taxes in the U.S.

source: Kinh doanh tại Mỹ
en: Doing business in the U.S.

source: Giáo dục tại Mỹ
en: Education in the U.S.

source: Trợ cấp, phúc lợi, an sinh xã hội Mỹ
en: Welfare, benefits and Social Security in the U.S.

source: Những người Việt thành công trên đất Mỹ
en: Immigrant success stories in the U.S.

source: Những câu chuyện định cư Mỹ truyền cảm hứng
en: Inspiring U.S. immigration journeys
